_posts/technology/2022-02-15-cppcoreguidelines-p13.html
---
layout: post
title: CppCoreGuidelines P.13 选用适当的库
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
设计精良、文档丰富、支持给力的程序库，可以节省大量的时间和精力。代码质量和文档一般来说会比自己开发更好。因为多个用户共享成果，分摊的时间、精力和金钱也会花费更少。广泛使用的程序库，维护的更好，也能更快适配新的系统，节省移植成本。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">{</span>4, 3, 6, 1, 9<span style="color: #707183;">}</span>;
<span style="color: #110099;">std</span>::sort<span style="color: #707183;">(</span>begin<span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, end<span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, <span style="color: #110099;">std</span>::greater<span style="color: #7388d6;">&lt;&gt;()</span><span style="color: #707183;">)</span>;
<span style="color: #110099;">std</span>::for_each<span style="color: #707183;">(</span>begin<span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, end<span style="color: #7388d6;">(</span>v<span style="color: #7388d6;">)</span>, <span style="color: #7388d6;">[](</span><span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">x</span><span style="color: #7388d6;">){</span><span style="color: #110099;">std</span>::cout&lt;&lt; x &lt;&lt; <span style="color: #2A00FF;">" "</span>;<span style="color: #7388d6;">}</span><span style="color: #707183;">)</span>;
</pre>
</div>

<pre class="example">
9 6 4 3 1
</pre>


<p>
通常标准库提供的排序算法执行效率比较高。除非有特殊原因，你需要自己实现排序等标准库中的算法。
</p>

<p>
尽量使用：
</p>
<ul class="org-ul">
<li>ISO C++ 标准库</li>
<li>Guidelines Support Library (GSL)</li>
</ul>
